src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВСпискеВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Скайп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляРегистрацииОшибок</name>
    <comment>Идентификатор пользователя во внешней системе для регистрации ошибок</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RestApiМетод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RestApiАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Выбрана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СинонимРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/СвязьПользовательРоль/СвязьПользовательРоль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьПользовательРоль</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ГруппыПользователейЦентрМониторинга/ГруппыПользователейЦентрМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователейЦентрМониторинга</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>РуководительГруппы</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчастникиГруппы</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтотОбъект.ПометкаУдаления
		Или ДополнительныеСвойства.Свойство(СловарьКлиентСервер.ИмяСвойстваНеВыполнятьСинхронизациюПользователя())
	Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
        
        ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ЭтотОбъект.УникальныйИдентификатор);
		Если ПользовательИБ = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
        КонецЕсли;
        
	Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ЭтотОбъект.УникальныйИдентификатор);
        Если ПользовательИБ = Неопределено Тогда
            
            ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Наименование);
            Если ПользовательИБ = Неопределено Тогда
                ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
            КонецЕсли;
            
		КонецЕсли;
	КонецЕсли;
	
	ПользовательИБ.Имя = ЭтотОбъект.Наименование;
	ПользовательИБ.ПоказыватьВСпискеВыбора = ЭтотОбъект.ПоказыватьВСпискеВыбора;
	ПользовательИБ.АутентификацияСтандартная = Истина;
		
	ПользовательИБ.Роли.Очистить();
	СохраненныеРоли = ЭтотОбъект.Роли.Выгрузить();	
	ЭтотОбъект.Роли.Очистить();
	
	Для Каждого ПраваСтрока Из СохраненныеРоли Цикл
		
		МетаданныеРоли = Метаданные.Роли.Найти(ПраваСтрока.Роль);
		Если МетаданныеРоли = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПраваСтрока.Выбрана Тогда
			ПользовательИБ.Роли.Добавить(МетаданныеРоли);
		КонецЕсли;
		
		РолиСтрокаТЧ = ЭтотОбъект.Роли.Добавить();
		РолиСтрокаТЧ.Выбрана = ПраваСтрока.Выбрана;
		РолиСтрокаТЧ.Роль = МетаданныеРоли.Имя;
		РолиСтрокаТЧ.СинонимРоли = МетаданныеРоли.Синоним;
			
	КонецЦикла;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство(СловарьКлиентСервер.ИмяСвойстваСохраняемыйПарольПользователя()) Тогда
		ПользовательИБ.Пароль = ЭтотОбъект.ДополнительныеСвойства[СловарьКлиентСервер.ИмяСвойстваСохраняемыйПарольПользователя()];
	КонецЕсли;
	
	ПользовательИБ.Записать();
	ЭтотОбъект.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
	
	Если ЭтоНовый() Тогда 
		Если ПользовательИБ.Роли.Содержит(Метаданные.Роли.ЦентрМониторингаРуководителиГруппы) Тогда 
			ЭтотОбъект.УстановитьСсылкуНового(Справочники.Пользователи.ПолучитьСсылку());
			ГруппаПользователей = Справочники.ГруппыПользователейЦентрМониторинга.СоздатьЭлемент();
			ГруппаПользователей.РуководительГруппы = ЭтотОбъект.ПолучитьСсылкуНового();
			ГруппаПользователей.Наименование = "Группа " + ЭтотОбъект.Наименование;
			ГруппаПользователей.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ЭтотОбъект.УникальныйИдентификатор);
	Если ПользовательИБ <> Неопределено Тогда
		ПользовательИБ.Удалить();
	КонецЕсли;
	
	НаборСвязей = РегистрыСведений.СвязьПользовательРоль.СоздатьНаборЗаписей();
	НаборСвязей.Отбор.Пользователь.Установить(ЭтотОбъект.Ссылка);
	НаборСвязей.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	УникальныйИдентификатор = "";
	Наименование = "";
КонецПроцедуры

#КонецЕсли
